#include "vmode.inl"

extern "C" EXPORT void mainMenu() {
    // 线程测试
    int a{0},b{0};
    youklx::窗口 窗口1;
    窗口1.配置().创建();
    窗口1.调整大小(0.1,0.1).调整位置();
    线程.更新包([&窗口1,&a](){
        if(窗口1.是否运行) {
            窗口1.运行();
            
        }
    });
    线程.绘制包([](){});
    while(窗口.是否运行) {
        线程.运行();
        窗口.运行();
        
        if(a >= 50){
            窗口1.关闭();
        }
        // 检测任意按键
            if (窗口.key.press('A')) {
                std::cout << 'A' << " ";
                a++;
                std::println("{}，，{}",窗口.时间.帧间隔,窗口.时间.有棵平滑);
            }
        
        
    }
    线程.包清理();
}